Repository: Mjdfsh/FraudSense
Catalog: lib/l10n/intl_*.arb
Languages: ar

# splashScreenButton
source: Get Started
ar: أبدأ

# splashScreenText
source: Protect yourself from Whatsapp phishing and fraud
ar: احمي نفسك من عمليات التصيد و الاحتيال بالواتساب

# loginScreen_emailField
source: Email
ar: البريد الاكتروني

# loginScreen_passwordField
source: Password
ar: الرقم السري

# loginScreen_forgotPasswordText
source: Forgot your password?
ar: نسيت الرقم السري؟

# loginScreen_signInButton
source: Sign In
ar: سجل الدخول

# loginScreen_createDividerText
source: Create
ar: انشئ

# loginScreen_dontHaveAnAccountText
source: Don't have an account?
ar: ليس لديك حساب؟

# loginScreen_signUp
source: Sign Up
ar: انشئ حساب

# resetPasswordScreen_title
source: Enter your email to reset your password.
ar: ادخل بريدك الاكتروني لاسترجاع الرقم السري

# resetPasswordScreen_emailHint
source: Email
ar: البريد الاكتروني

# resetPasswordScreen_emptyEmailFieldWarning
source: Please enter an email
ar: برجاء ادخال بريد اكتروني

# resetPasswordScreen_invalidEmailFieldWarning
source: Please enter a valid email
ar: برجاء ادخل بريد اكتروني صالح

# resetPasswordScreen_resetButton
source: Send reset email
ar: ارسل بريد الاستعادة

# signUpScreen_titleSignUpText
source: Sign Up
ar: انشاء حساب

# signUpScreen_titleText
source: Join FraudSense to start learning now
ar: ادخل FraudSense وابدأ التعلم

# signUpScreen_surnameField
source: Your Surname
ar: اسم العائلة

# signUpScreen_emailField
source: Your Email
ar: بريدك

# signUpScreen_usernameField
source: Your Username
ar: اسم المستخدم

# signUpScreen_passwordField
source: Your Password
ar: رقمك السري

# signUpScreen_confirmPasswordField
source: Confirm Password
ar: اكد الرقم السري

# signUpScreen_getStartedButton
source: Get Started
ar: ابدأ الان

# signUpScreen_alreadyAMember
source: Already a member?
ar: عضو بالفعل؟

# signUpScreen_login
source: Login
ar: سجل الدخول

# signUpScreen_surnameFieldTitle
source: Your surname
ar: اسم عائلك

# signUpScreen_emailFieldTitle
source: Your Email
ar: بريدك الاكترني

# signUpScreen_UsernameFieldTitle
source: Your Username
ar: اسم المستخدم

# signUpScreen_passwordFieldTitle
source: Choose a secure password
ar: اختر رقم سري آمن

# signUpScreen_confirmPasswordFieldTitle
source: Confirm your password
ar: اكد رقمك السري

# signUpScreen_enterSurnamePopUp
source: Please enter a surname
ar: برجاء ادخال اسم العائلة

# signUpScreen_enterEmailPopUp
source: Please enter valid email
ar: برجاء ادخل بريد اكتروني صالح

# signUpScreen_enterUsernamePopUp
source: Please enter a username
ar: برجاء ادخال اسم مسخدم

# signUpScreen_enterPasswordPopUp
source: Please enter a password
ar: برجاء ادخال رقم سري

# signUpScreen_enterConfirmedPasswordPopUp
source: Please confirm your password
ar: برجاء تأكيد الرقم السري

# signUpScreen_passwordNotMatch
source: Password does not match
ar: الرقم السري لا يتطابق

# firebaseAuthErrorCodes_invalid_credential
source: The credentials you entered are not correct
ar: المعلومات التي ادخلتها غير صحيحة

# firebaseAuthErrorCodes_invalid_email
source: The email you entered is invalid
ar: البريد الذي ادخلته غير صالح

# firebaseAuthErrorCodes_user_not_found
source: The account you entered is not found
ar: الحساب الذي ادخلته غير موجود

# firebaseAuthErrorCodes_wrong_password
source: The password you entered is wrong
ar: الرقم السري الذي ادخلته غير صحيح

# firebaseAuthErrorCodes_user_disabled
source: The account you're accessing is disabled
ar: الحساب الذي تحاول الوصول له موقوف

# firebaseAuthErrorCodes_email_already_in_use
source: The email you entered is already in use
ar: البريد الذي ادخلته مستعمل من قبل

# firebaseAuthErrorCodes_username_taken
source: The username you entered is already in use
ar: اسم المستخدم الذي ادخلته تم اخذه من قبل

# firebaseAuthErrorCodes_weak_password
source: The password you entered is weak. It must be at least 8 characters long and contains one upper case and one lower case letters
ar: الرقم السري الذي ادخلته ضعيف. يجب على الرقم السري ان يكون بالانجليزية واطول من 8 احرف ويحتوي على حرف كبير وحرف اخر صغير

# firebaseAuthErrorCodes_long_username
source: The maximum length of the username is 20 characters
ar: الحد الاقصى لاسم المستخدم هو 20 حرف

# signOutButton_PopUpTitle
source: Are you sure you want to sign out?
ar: هل تريد تسجيل الخروج؟

# frontTab_singedInAsText
source: Signed in as:
ar: مسجل الدخول كـ

# frontTab_welcomeText
source: Welcome back
ar: مرحبا بك يا

# frontTab_cardPlayGameTitle
source: Play a Game
ar: العب لعبة

# frontTab_cardPlayGameDescription
source: Test your phishing detection skills
ar: تحدي مهاراتك بمعرفة الاحتيال

# frontTab_cardLeaderboardTitle
source: View Leaderboard
ar: عرض لوحة المتصدرين

# frontTab_cardLeaderboardDescription
source: Compare your phishing detection skills with other players
ar: قارن مهارتك بمعرفة الاحتيال ضد اللاعبين الاخرين

# frontTab_cardProgressTitle
source: View Progress
ar: عرض تقدمك

# frontTab_cardProgressDescription
source: Track your progress and achievements
ar: تتبع تقدمك وإنجازاتك

# frontTab_statisticsTitle
source: Statistics
ar: الاحصائيات

# frontTab_statisticsDescription
source: Track your gameplay performance with detailed insights and analyze your progress
ar: تتبع اداءك باللعبة بمعلومات مفصلة وحلل تقدمك

# levelsTab_title
source: Levels
ar: المراحل

# levelsTab_loading
source: Loading..
ar: جاري اتحميل..

# levelsTab_levelPopUpSelectedLevel
source: You selected level
ar: لقد اخترت المرحلة

# levelsTab_levelPopUpLockedLevel
source: You haven't unlocked this level yet
ar: لم تقم بفتح هذه المرحلة

# levelsTab_levelPopUpStartLevel
source: Start level
ar: ابدأ المرحلة

# profileTab_achievements
source: Achievements
ar: الإنجازات

# profileTab_coins
source: Coins
ar: العملات

# profileTab_hints
source: Hints
ar: التلميحات

# profileTab_points
source: Points
ar: النقاط

# profileTab_achievementsCompletedLevelsTitle
source: Completed Levels
ar: المراحل المكتملة

# profileTab_achievementsCompletedLevelsBottomText
source: Complete All Levels
ar: اكمل جميع المراحل

# profileTab_achievementsPointsTitle
source: Points Gained
ar: النقاط المكتسبة

# profileTab_achievementsPointsBottomText1
source: Reach
ar: اوصل لـ

# profileTab_achievementsPointsBottomText2
source: Points
ar: نقطعة

# game_submitButton
source: Submit
ar: تأكيد

# game_popUpNext
source: Next
ar: التالي

# game_popUpQuit
source: Quit
ar: توقف

# game_popUpExit
source: Exit
ar: الخروج

# game_popUpNextScenario
source: Next scenario
ar: المحادثة التالية

# game_popUpReturnToGame
source: return to game
ar: عد الى اللعبة

# game_popUpViewMistakes
source: View mistakes
ar: معاينة الاخطاء

# game_confirmQuit
source: Are you sure you want to quit?
ar: تأكيد الخروج؟

# game_popUpTimeRanOutTitle
source: Time has ran out!
ar: انتهى الوقت!

# game_popUpPauseTitle
source: You paused the game
ar: لقد أوقفت اللعبة

# game_popUpAlreadyFinishedScenario
source: You have finished this scenario
ar: لقد انتهيت من هذه المحادثة

# game_hintsPopUpShowHint
source: Show a hint
ar: أظهر تلميحا

# game_hintsPopUpBuyHint
source: Buy a hint
ar: شراء تلميحا

# game_hintsPopUpTitle
source: Amount of hints left in your account:
ar: عدد التلميحات المتبقية:

# game_hintsPopUpTitle1
source: Do you wish to use one now?
ar: هل تريد استخدام تلميح؟

# game_hintsPopUpAlreadyUnlocked
source: You already unlocked this hint
ar: لقد قمت بالفعل بفتح هذا التلميح

# game_rightAnswer
source: you got it right! just in
ar: إجابة صحيحة! اجبت خلال

# game_rightAnswer1
source: seconds
ar: ثواني

# game_wrongAnswer
source: You got it wrong!
ar: إجابة خاطئة!

# game_endPopUpTitle
source: You finished the level, you got
ar: لقد أنهيت المرحلة، حصلت على

# game_endPopUpTitle1
source: answer(s) right out of
ar: اجابات صحيحة من

# game_endPopUpTitleAllWrong
source: You finished the level, you got none of the questions right
ar: لقد أنهيت المرحلة، جميع إجاباتك خاطئة

# game_mistakeSummaryPickedAnswer
source: You picked this answer
ar: لقد اخترت هذه الإجابة

# game_mistakeSummaryExplanation
source: Explanation
ar: التفسير

# game_leaderboardTitle
source: Leaderboard
ar: لوحة المتصدرين

# game_leaderboardPoints
source: Points
ar: النقاط

# game_leaderboardUsername
source: Username
ar: اسم المستخدم

# statisticsScreen_generalTitleText
source: General
ar: عام

# statisticsScreen_streakTitleText
source: Streak
ar: الانتصارات

# statisticsScreen_levelsTitleText
source: Levels
ar: المراحل

# statisticsScreen_loggedDays
source: Logged in days
ar: ايام تسجيل الدخول

# statisticsScreen_ranking
source: Ranking
ar: الترتيب

# statisticsScreen_currentStreak
source: Current Streak
ar: الانتصارات المتتالية

# statisticsScreen_longestStreak
source: Longest Streak
ar: افضل الانتصارات المتتالية

# statisticsScreen_unlockedLevels
source: Unlocked Levels
ar: المراحل المفتوحة

# statisticsScreen_levelsListLevelTitle
source: Level
ar: المرحة

# statisticsScreen_levelsListFailsTitle
source: Fails
ar: مرات الفشل

# statisticsScreen_levelsListSolveTimeTitle
source: Solve Time
ar: وقت الحل

# statisticsScreen_levelsListLevelNo
source: No.
ar: رقم

# statisticsScreen_levelsListLevelFailTimes
source: Times
ar: مرة

# statisticsScreen_levelsListTitle
source: Completed Levels
ar: المراحل المكملة

# shopPopUp_canBuy
source: Want to buy a hint for 75 coins?
ar: هل تريد شراء تلميح بـ 75 عملة؟

# shopPopUp_cantBuy
source: You don't have enough coins to buy a hint
ar: لا تملك العملات الكافية لشراء تلميح

# popUpReturn
source: return
ar: ارجع

# popUpConfirm
source: Confirm
ar: تأكيد

# nextButton
source: Next
ar: التالي

# previousButton
source: Previous
ar: السابق
